lhd-Sakura/A_Project/STM32CubeMX/FourWheel_driveMAX/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Speed_BR_Pin GPIO_PIN_0
#define Speed_BR_GPIO_Port GPIOA
#define Speed_BL_Pin GPIO_PIN_6
#define Speed_BL_GPIO_Port GPIOA
#define BL_1_Pin GPIO_PIN_6
#define BL_1_GPIO_Port GPIOC
#define BL_2_Pin GPIO_PIN_7
#define BL_2_GPIO_Port GPIOC
#define BR_1_Pin GPIO_PIN_8
#define BR_1_GPIO_Port GPIOC
#define BR_2_Pin GPIO_PIN_9
#define BR_2_GPIO_Port GPIOC
#define Speed_FL_Pin GPIO_PIN_8
#define Speed_FL_GPIO_Port GPIOA
#define Speed_FR_Pin GPIO_PIN_3
#define Speed_FR_GPIO_Port GPIOB
#define FL_1_Pin GPIO_PIN_6
#define FL_1_GPIO_Port GPIOB
#define FL_2_Pin GPIO_PIN_7
#define FL_2_GPIO_Port GPIOB
#define FR_1_Pin GPIO_PIN_8
#define FR_1_GPIO_Port GPIOB
#define FR_2_Pin GPIO_PIN_9
#define FR_2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
